package com.juliya_lu_kim.homework21_ArrayList.Task1;

/*

1)Пользователь вводит с клавиатуры набор чисел.
Полученные числа необходимо сохранить в список.
После чего нужно показать меню,
в котором предложить пользователю набор пунктов:
1. Добавить элемент в список.
2. Удалить элемент из списка.
3. Показать содержимое списка.
4. Проверить есть ли значение в списке.
5. Заменить значение в списке.
В зависимости от выбора пользователя выполняется
действие, после чего меню отображается снова.
 */

import java.io.IOException;

public class NumbersListRunning {
    public static void main(String[] args) throws IOException {
        NumbersList list = new NumbersList();  // создание экземпляра класса ArrayList
        list.fillArrayList(); // вызов метода для заполнения списка значениями
        list.menu();  // вызов метода меню для работы со списком
    }
}
